###Setup steps
#
## Install xcode command line tools
# xcode-select --install
#
## Checkout dotfiles
# alias tildedotfiles="git --work-tree=$HOME --git-dir=$HOME/.tilde.git"
# tildedotfiles init
# tildedotfiles remote add origin git@github.com:opichals/tilde.git
# tildedotfiles fetch
#
## Get the brew ready
# /usr/bin/ruby -e "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)"
# brew tap homebrew/bundle
#
# cd .tildesetup
# brew bundle
#

tap 'caskroom/cask'
tap "homebrew/bundle"
tap "homebrew/services"

brew 'mas'

## gtimeout, gps, etc
# brew "coreutils"
# brew "pstree"
brew "watch"

# JSON/YAML cli (jq, yq, xq, jless, ...)
brew "jq"
brew 'python-yq'
brew 'jless'

# VPN
brew "ocproxy"
brew "openconnect"

# Storage
brew "mongodb", restart_service: true
brew "redis", restart_service: true

# Networking
brew "dnsmasq", restart_service: true

# prg
brew 'git'
brew 'git-absorb'
brew 'git-delta'
brew 'lazygit'

brew 'httpie'
brew 'vim'
# brew "hub"
# brew 'heroku'
brew 'awscli'

brew 'kubectl'
brew 'helm'
brew 'fluxcd/tap/flux'

# brew "nvm"
# brew "python"
brew 'node@12'

# JIRA cli
# tap "kylef/formulae"
# brew "kylef/formulae/goji"

# system tools
cask 'monitorcontrol'
brew 'rectangle'
# cask 'spectacle'
cask 'karabiner-elements'
brew 'espanso'
brew 'ripgrep'
# cask 'flycut'
# cask 'gpg-suite'
# cask 'docker'

# quick look plugins
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'

# Security
cask 'bitwarden'
cask 'bitwarden-cli'
cask 'authy'

# IDEs
cask 'visual-studio-code'

# Browsers
cask 'google-chrome'
cask 'firefox'

# tap "apiaryio/formulae"
# brew "apiaryio/formulae/blackbelt"

# Other
mas 'Slack', id: 803453959


# Last update
# brew 'nvm'
# brew 'python@3.11'
# brew 'poetry'
# brew 'postgresql'
#
## for elis-backend
# brew 'pybind11'
# brew 're2'
# brew 'zbar'
# brew 'qpdf'
# brew 'poppler'
# brew 'libmagic'
#
## for uptime-tests
# brew 'pipenv'
#
# SQL and structured pipes
# brew 'nushell'
# brew 'duckdb'
